In [5]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql
drop table if exists Students;
drop table if exists Specialities;

CREATE TABLE Specialities
(
    id integer primary key,
    Name varchar(50)
);

 * sqlite://
Done.
Done.
Done.

[]

In [7]:
%sql select * from Specialities

 * sqlite://
Done.

[]

In [8]:
%%sql
insert Into Specialities(id, name) values (1, 'Биотехнические системы и технологии');
insert Into Specialities(id, name) values (2, 'Компьютерная безопасность');
insert Into Specialities(id, name) values (3, 'Прикладная математика и информатика');
insert Into Specialities(id, name) values (4, 'Мехатроника и робототехника');
insert Into Specialities(id, name) values (5, 'Системный анализ и управление');
insert Into Specialities(id, name) values (6, 'Информационная безопасность телекоммуникационных систем');
insert Into Specialities(id, name) values (7, 'Управление в технических системах');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite://
Done.

[]

In [21]:
%%sql
drop table if exists Students;

CREATE TABLE Students
(
    student_id integer primary key,
    Name varchar(50),
    SecondName varchar(50),
    Speciality_id integer ,
    StudyGroup varchar(20),
    GPA number,
    foreign key(Speciality_id) references Specialities(id)
);

 * sqlite://
Done.
Done.

[]

In [20]:
%sql drop table if exists Students;

 * sqlite://
Done.

[]

In [22]:
%%sql
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (1, 'Альянов', 'Николай', 1, '04-20', 3.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (2, 'Крыгина', 'Ева', 1, '01-20', 4.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (3, 'Исаева', 'Анна', 1, '01-20', 4.75);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (4, 'Егоров', 'Павел', 2, '01-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (5, 'Тихомиров', 'Тимофей', 2, '03-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (6, 'Ширшов', 'Александр', 2, '06-20', 3.91);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (7, 'Фатеев', 'Максим', 3, '05-20', 3.8);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (8, 'Киселев', 'Петр',  3, '05-20', 3.5);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (9, 'Агашкина', 'Дарья', 4, '02-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (10, 'Горин', 'Олег', 5, '01-20', 3.89);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (11, 'Комарова', 'Екатерина', 6, '02-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (12, 'Челыхов', 'Иван', 6, '06-20', 4.45);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (13, 'Назаров', 'Александр', 6, '06-20', 3.73);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (14, 'Горлова', 'Ксения', 7, '01-20', 5);
select * from students

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (7, 'Максим', 'Фатеев', 3, '05-20', 3.8),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Екатерина', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]

In [24]:
%sql select * from Specialities

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии'),
 (2, 'Компьютерная безопасность'),
 (3, 'Прикладная математика и информатика'),
 (4, 'Мехатроника и робототехника'),
 (5, 'Системный анализ и управление'),
 (6, 'Информационная безопасность телекоммуникационных систем'),
 (7, 'Управление в технических системах')]

Задание 1. Напишите SQL-запрос, возвращающий фамилии всех студентов с именем Александр

In [25]:
%sql select secondname from students where name == 'Александр';

 * sqlite://
Done.

[('Ширшов',), ('Назаров',)]

Задание 2. Выведите все названия специальностей, на которых учится хотя бы один студент со средним баллом 4.5 и выше. Имя специальности должно встречаться один раз в выводе

In [28]:
%%sql
select name from Specialities where id in (select Speciality_id from students where GPA >= 4.5)

 * sqlite://
Done.

[('Биотехнические системы и технологии',),
 ('Компьютерная безопасность',),
 ('Информационная безопасность телекоммуникационных систем',),
 ('Управление в технических системах',)]

Задание 3. Вывести только тех студентов, фамилия которых начинается с буквы 'к', а в имени есть буква 'е'.

In [35]:
%sql select * from students where (secondname like 'К%') and ((name like '%е%') or (name like 'Е%'))

 * sqlite://
Done.

[(2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (11, 'Екатерина', 'Комарова', 6, '02-20', 4.83)]

Задание 4. Вывести специальности (+ их средние баллы), количество групп в которых больше одной

In [53]:
%%sql
--попытка №1 (частичный успех)
select *from Specialities where id in(
select Speciality_id
from students
group by Speciality_id
having COUNT(distinct StudyGroup) > 1)

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии'),
 (2, 'Компьютерная безопасность'),
 (6, 'Информационная безопасность телекоммуникационных систем')]

In [64]:
%%sql
--попытка №2 (успех)
select SP.id, SP.Name, avg(ST.GPA)
 from Specialities SP
 join Students ST
 on ST.Speciality_id = SP.id
group by ST.Speciality_id
having COUNT(distinct StudyGroup) > 1

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии', 4.303333333333334),
 (2, 'Компьютерная безопасность', 4.306666666666667),
 (6, 'Информационная безопасность телекоммуникационных систем', 4.336666666666667)]

In [58]:
%sql select * from students

 * sqlite://
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (7, 'Максим', 'Фатеев', 3, '05-20', 3.8),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Екатерина', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]

Задание 5. Для всех специальностей вывести средний балл по специальности для студентов, в чьей фамилия вторая буква НЕ 'а', при условии, что количество таких студентов на специальности не менее 2. В обратном случае, специальность выводить не требуется

In [73]:
%%sql
select SP.id, SP.name, avg(ST.GPA)
from (select * from students where secondname not like '_а%') ST
join Specialities SP
on ST.Speciality_id = SP.id
group by ST.Speciality_id
having COUNT(ST.student_id) > 1

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии', 4.303333333333334),
 (2, 'Компьютерная безопасность', 4.306666666666667),
 (6, 'Информационная безопасность телекоммуникационных систем', 4.640000000000001)]

In [70]:
%sql select * from students where secondname not like '_а%'

 * sqlite://
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Екатерина', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]